#pragma once
/*
キー入力に関する補助関数
DXLibに存在しないので自作
*/

/******************************************************************************
 * @fn      CheckDownKey
 * @brief   キー押下瞬間検出
 * @param   KeyCode : キーコード
 * @return  int : 押された瞬間なら1
 * @detail  指定キーが押された瞬間のみ検出する
 ******************************************************************************/
int CheckDownKey(int KeyCode);

/******************************************************************************
 * @fn      CheckUpKey
 * @brief   キー離し瞬間検出
 * @param   KeyCode : キーコード
 * @return  int : 離された瞬間なら1
 * @detail  指定キーが離された瞬間のみ検出する
 ******************************************************************************/
int CheckUpKey(int KeyCode);