#pragma once
#include "DxLib.h"
#include "CheckKey.h"
#include "windef.h"
#include "Game Common.h"
#include "Shot.h"
#include "Init.h"
#include <math.h>
#include <time.h>

/******************************************************************************
 * @fn      ShotAdd2
 * @brief   自機ショット追加
 ******************************************************************************/
void ShotAdd2(int x, int y, int radius, double angle, double speed);	//!< 自機ショットの追加関数

/******************************************************************************
 * @fn      PlayerShot
 * @brief   自機ショット処理
 ******************************************************************************/
void PlayerShot(void);

/******************************************************************************
 * @fn      ShotAdd
 * @brief   敵ショット追加
 ******************************************************************************/
void ShotAdd(int x, int y, int radius, double angle, double speed);



/******************************************************************************
 * @fn      ShotType1
 * @brief   敵ショットパターン1
 ******************************************************************************/
void ShotType1(void);

/******************************************************************************
 * @fn      ShotType2
 * @brief   敵ショットパターン2
 ******************************************************************************/
void ShotType2(void);

/******************************************************************************
 * @fn      ShotType3
 * @brief   敵ショットパターン3
 ******************************************************************************/
void ShotType3(void);

/******************************************************************************
 * @fn      ShotType4
 * @brief   敵ショットパターン4
 ******************************************************************************/
void ShotType4(void);

/******************************************************************************
 * @fn      ShotType5
 * @brief   敵ショットパターン5
 ******************************************************************************/
void ShotType5(void);

static void (*enemyShred[])(void) =
{
	ShotType1,//敵のショットパターン１関数:3WAYショット
	ShotType2,//敵のショットパターン２関数:全方向ショット
	ShotType3,//敵のショットパターン３関数:一点集中時間差ショット
	ShotType4,//敵のショットパターン４関数:ばら撒きショット
	ShotType5,//敵のショットパターン５関数:ランダムショット
};

static void (*playerShred[])(void) =
{
	PlayerShot,//自機のショット関数
};

/******************************************************************************
 * @fn      CheckHitPointCircle
 * @brief   点と円の当たり判定
 ******************************************************************************/
bool CheckHitPointCircle(POINT& point, int circleX, int circleY, int circleRadius);

/******************************************************************************
 * @fn      CheckHitRectCircle
 * @brief   矩形と円の当たり判定
 ******************************************************************************/
bool CheckHitRectCircle(RECT& rect, int circleX, int circleY, int circleRadius);